### Pandas

- It means paneldata
- pandas is the datascience package
- It is used for
    - Data manupulation(modifications,updations)
    - Data analysis
    - Data cleaning(to remove unneccessary data from data sets 
- Contains mainly two data structures in pandas
    - Series - Sequence of data
    - Data Frames - data with row and columns

In [1]:
#installation
pip install pandas   #pip-prefered installer program

Requirement already satisfied: pandas in c:\users\babykaligineedi\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\babykaligineedi\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\babykaligineedi\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\babykaligineedi\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\babykaligineedi\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas

In [4]:
import pandas as pd

In [5]:
#version
pd.__version__

'1.0.5'

### Series
- syntax:pd.Series(data,index,dtype)

In [9]:
import pandas as pd
s="hello"
print(type(s))
a=pd.Series(s)
print(a)
print(type(a))

<class 'str'>
0    hello
dtype: object
<class 'pandas.core.series.Series'>

In [10]:
s='hi good morning to everyone'.split()
pd.Series(s)

0          hi
1        good
2     morning
3          to
4    everyone
dtype: object

In [13]:
pd.Series(s,index=[1,2,3,4,5])

1          hi
2        good
3     morning
4          to
5    everyone
dtype: object

In [14]:
li=[12,'python',12.3]
pd.Series(li,index=['int','str','float'])

int          12
str      python
float      12.3
dtype: object

In [15]:
t=('a','e','i','o','u')
pd.Series(t,index=['v1','v2','v3','v4','v5'])

v1    a
v2    e
v3    i
v4    o
v5    u
dtype: object

In [19]:
dic={'key1':123,'key2':'hello','key3':34.5}
pd.Series(dic)

key1      123
key2    hello
key3     34.5
dtype: object

#### DataFrames

In [20]:
#creating data using data frames
d=pd.DataFrame([1,2,3,4,5])
d

   0
0  1
1  2
2  3
3  4
4  5

In [21]:
s='clear but not understand'.split()
pd.DataFrame(s)

            0
0       clear
1         but
2         not
3  understand

In [22]:
li=[[1,2,3],[4,5,6]]
pd.DataFrame(li,index=['list1','list2'])

       0  1  2
list1  1  2  3
list2  4  5  6

In [23]:
d={'k1':'h','k2':'e','k3':'i'}
pd.DataFrame(d,index=[1,2,3])

  k1 k2 k3
1  h  e  i
2  h  e  i
3  h  e  i

In [25]:
#creating dataframe using list
dic={'Names':['sindhuja','magana','bharathi'],'Marks':[45,46,47],'id':['N130035','N130036','N130037']}
pd.DataFrame(dic,index=['stu1','stu2','stu3'])

         Names  Marks       id
stu1  sindhuja     45  N130035
stu2    magana     46  N130036
stu3  bharathi     47  N130037

In [27]:
df1=pd.DataFrame({'n_p':[3,4,5,6],'n_h':[20,34,56,67]},index=[2001,2020,2034,2056])
df1

      n_p  n_h
2001    3   20
2020    4   34
2034    5   56
2056    6   67

In [28]:
df2=pd.DataFrame({'mnth':[2,3,4,5],'days':[34,56,67,23]},index=[2001,2004,2020,2003])
df2

      mnth  days
2001     2    34
2004     3    56
2020     4    67
2003     5    23

In [29]:
df2.join(df1)

      mnth  days  n_p   n_h
2001     2    34  3.0  20.0
2004     3    56  NaN   NaN
2020     4    67  4.0  34.0
2003     5    23  NaN   NaN

In [30]:
df1.join(df2)

      n_p  n_h  mnth  days
2001    3   20   2.0  34.0
2020    4   34   4.0  67.0
2034    5   56   NaN   NaN
2056    6   67   NaN   NaN

In [31]:
conct=pd.concat([df1,df2])
conct

      n_p   n_h  mnth  days
2001  3.0  20.0   NaN   NaN
2020  4.0  34.0   NaN   NaN
2034  5.0  56.0   NaN   NaN
2056  6.0  67.0   NaN   NaN
2001  NaN   NaN   2.0  34.0
2004  NaN   NaN   3.0  56.0
2020  NaN   NaN   4.0  67.0
2003  NaN   NaN   5.0  23.0

In [33]:
#data frames using tuple
import numpy as np
d={'Names':('sindhu','magana','bharathi',''),'Rollnum':('034','037','038','040'),'Grades':('A','A','B','A+')}
data=pd.DataFrame(d,index=np.arange(1,5))
data

      Names Rollnum Grades
1    sindhu     034      A
2    magana     037      A
3  bharathi     038      B
4               040     A+

In [41]:
data1={'one':pd.Series([1,2,3,4],index=['a','b','c','d']),'two':pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])}
pd.DataFrame(data1)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  NaN    5

In [42]:
data1=data.values
print(data1)
print(data1.ndim)

[['sindhu' '034' 'A']
 ['magana' '037' 'A']
 ['bharathi' '038' 'B']
 ['' '040' 'A+']]
2

In [43]:
for i in data1:
    print(i[0])

sindhu
magana
bharathi

In [44]:
for i in data1:
    print(i[1])

034
037
038
040

In [45]:
data.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [47]:
data

      Names Rollnum Grades
1    sindhu     034      A
2    magana     037      A
3  bharathi     038      B
4               040     A+

In [48]:
data['Names'][1]

'sindhu'

In [49]:
data['Grades'][3]

'B'

In [50]:
data[0:1]

    Names Rollnum Grades
1  sindhu     034      A

In [51]:
data[0:4]

      Names Rollnum Grades
1    sindhu     034      A
2    magana     037      A
3  bharathi     038      B
4               040     A+

In [52]:
data[-1:]

  Names Rollnum Grades
4           040     A+

In [53]:
marks=pd.read_csv('marks.csv')
marks

       Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97

In [54]:
marks.head()  #1st five samples of data

       Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76

In [55]:
marks.head(3)

     Subject       p     e   r    s   k
0  Maths        78    89   75   83   99
1  Telugu       89    85   78   58   92
2  English      76    56   78   89   93

In [56]:
marks.head(7)

       Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97

In [57]:
marks.head(10)

       Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97

In [58]:
marks.tail()   #last five samples of data

       Subject       p     e   r    s   k
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97

In [59]:
marks.tail(3)

     Subject       p     e   r    s   k
4  Science      89    87   97   94   76
5  Social       76    84   83   95   97
6  IT           98    92   94   96   97

In [61]:
pd.read_csv('marks.csv',header=None)

                                        0
0      Subject       p     e   r    s   k
1    Maths        78    89   75   83   99
2    Telugu       89    85   78   58   92
3    English      76    56   78   89   93
4  Hindi        78    78   89   97   87
5    Science      89    87   97   94   76
6    Social       76    84   83   95   97
7    IT           98    92   94   96   97

In [60]:
marks

       Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97

In [64]:
df=pd.read_csv('marks.csv',names=['N','M','S'])
df

                                        N   M   S
0      Subject       p     e   r    s   k NaN NaN
1    Maths        78    89   75   83   99 NaN NaN
2    Telugu       89    85   78   58   92 NaN NaN
3    English      76    56   78   89   93 NaN NaN
4  Hindi        78    78   89   97   87   NaN NaN
5    Science      89    87   97   94   76 NaN NaN
6    Social       76    84   83   95   97 NaN NaN
7    IT           98    92   94   96   97 NaN NaN

In [65]:
df['S']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
Name: S, dtype: float64

In [68]:
df[['S','N']]

    S                                       N
0 NaN      Subject       p     e   r    s   k
1 NaN    Maths        78    89   75   83   99
2 NaN    Telugu       89    85   78   58   92
3 NaN    English      76    56   78   89   93
4 NaN  Hindi        78    78   89   97   87
5 NaN    Science      89    87   97   94   76
6 NaN    Social       76    84   83   95   97
7 NaN    IT           98    92   94   96   97

In [69]:
marks

       Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97

In [70]:
marks.columns

Index(['Subject       p     e   r    s   k'], dtype='object')

In [71]:
marks.info

<bound method DataFrame.info of        Subject       p     e   r    s   k
0    Maths        78    89   75   83   99
1    Telugu       89    85   78   58   92
2    English      76    56   78   89   93
3  Hindi        78    78   89   97   87
4    Science      89    87   97   94   76
5    Social       76    84   83   95   97
6    IT           98    92   94   96   97>

In [72]:
marks.describe()   #Statistics of data

          Subject       p     e   r    s   k
count                                      7
unique                                     7
top     English      76    56   78   89   93
freq                                       1

In [73]:
marks.index

RangeIndex(start=0, stop=7, step=1)

In [74]:
marks.shape

(7, 1)

In [75]:
marks.shape[0]  #num of rows

7

In [76]:
marks.shape[1]   #no of columns

1

In [77]:
marks.isnull()

   Subject       p     e   r    s   k
0                               False
1                               False
2                               False
3                               False
4                               False
5                               False
6                               False

In [78]:
df.isnull()

       N     M     S
0  False  True  True
1  False  True  True
2  False  True  True
3  False  True  True
4  False  True  True
5  False  True  True
6  False  True  True
7  False  True  True